import time
import os 
from os import *
import colorama
import sys
from tqdm import tqdm
import webbrowser

os.system('cls')
print("""
███████╗██╗████████╗███████╗    ██╗    ██╗███████╗██████╗ 
██╔════╝██║╚══██╔══╝██╔════╝    ██║    ██║██╔════╝██╔══██╗
███████╗██║   ██║   █████╗      ██║ █╗ ██║█████╗  ██████╔╝
╚════██║██║   ██║   ██╔══╝      ██║███╗██║██╔══╝  ██╔══██╗
███████║██║   ██║   ███████╗    ╚███╔███╔╝███████╗██████╔╝
╚══════╝╚═╝   ╚═╝   ╚══════╝     ╚══╝╚══╝ ╚══════╝╚═════╝TRAX®️ 
                                                          
""")

print(colorama.Fore.LIGHTGREEN_EX + "\nPréparation...🛰️")
for i in tqdm(range(0,int(46705510))):
  continue
system('cls')
print(colorama.Fore.CYAN + "Lancement de la fenêtre virtuelle 👁️")
time.sleep(2)
webbrowser.open('https://hck-siteweb.netlify.app/')